---
kind: method
id: M:Autodesk.Revit.DB.DimensionSegmentArray.Append(Autodesk.Revit.DB.DimensionSegment)
source: html/86b33547-3f92-de80-21ff-21e3cb003e9b.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.Append Method

Add the item to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	DimensionSegment item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.DimensionSegment`) - The item to be added.